from gruut import sentences
import sys

texte=[]
if len(sys.argv)>2:
    for i in sys.argv[1:]:
        texte.append(i)
else:
    texte = ["Lorem Ipsum !", "Lorèm Ipsom"]

def kata(a):
    dico = {
        # 5 phonèmes
        "ʁijɛ̃": "リャン",
        # 4 phonèmes
        "bjɛ̃": "ビャン","bjɑ̃": "ビャンー","bjɔ̃": "ビョン",
        "sjɛ̃": "スィャン","sjɑ̃": "スィャンー","sjɔ̃": "スィョン",
        "tjɛ̃": "ティャン","tjɑ̃": "テャンー","tjɔ̃": "ティョン",
        "mjɛ̃": "ミャン","mjɑ̃": "ミャンー","mjɔ̃": "ミョン",
        "vjɛ̃": "ヴィャン","vjɑ̃": "ヴィャンー","vjɔ̃": "ヴィョン",
        "ʁjɛ̃": "リャン","ʁjɑ̃": "リャンー","ʁjɔ̃": "リョン",
        "njɛ̃": "ニャン","njɑ̃": "ニャンー","njɔ̃": "ニョン",
        "ʃjɛ̃": "シィャン","ʃjɑ̃": "シィャンー","ʃjɔ̃": "シィョン",
        # 3 phonèmes
        "kij": "キー", "njɑ": "ニャ", "njœ": "ニュ", "pja": "ピャ", "pjɔ": "ピョ", "vja": "ヴャ", "vjø": "ヴュ", "vjœ": "ヴュ",
        "vjɛ": "ヴィェ", "vje": "ヴィェー", "vjɔ": "ヴョ", "vjo": "ヴョー", "kɑ̃": "カンー", "kœ̃": "カン", "kɔ̃": "コン", "sɑ̃": "サンー",
        "sɛ̃": "サン", "sɔ̃": "ソン", "tɑ̃": "タンー", "tɛ̃": "タン", "tɔ̃": "トン", "nɑ̃": "ナンー", "nɛ̃": "ナン", "nɔ̃": "ノン",
        "mɑ̃": "マンー", "mɛ̃": "マン", "mɔ̃": "モン", "lɑ̃": "ランー", "ʁɑ̃": "ランー", "lɛ̃": "ラン", "ʁɛ̃": "ラン",
        "ʁɔ̃": "ロン","kɛ̃": "カン",
        "lɔ̃": "ロン", "ʃɑ̃": "シャンー", "ʃɔ̃": "ション", "ɡɑ̃": "ガンー", "ɡɛ̃": "ガン", "ɡɔ̃": "ゴン", "zɑ̃": "ザンー", "ʒɑ̃": "ヂャンー",
        "dɑ̃": "ダンー", "ʒɛ̃": "ジャン", "bɛ̃": "バン", "bɔ̃": "ボン", "bɑ̃": "バンー", "dɔ̃": "ドン", "pɑ̃": "パンー", "pɛ̃": "パン",
        "pɔ̃": "ポン",
        "fɑ̃": "ファンー", "vɛ̃": "ヴァン", "zɛ̃": "ザン", "zɔ̃": "ゾン", "fɛ̃": "ファン", "vɑ̃": "ヴァンー", "tje": "ティェー",
        "tjɛ": "ティェ", "tja": "テャ", "tjo": "ティョー", "tjɔ": "ティョ", "dje": "ディェー", "djɛ": "ディェ", "dja": "ディャ", "djo": "ディョー",
        "djɔ": "ディョ", "fje": "フィェー", "fjɛ": "フィェ", "fja": "フャ", "fjo": "フョー", "fjɔ": "フョ", "sjɛ": "スィェ", "sje": "スィェー",
        "sja": "スィャ", "sjo": "スィョー", "sjɔ": "スィョ", "ʁœ̃": "ラン", "zœ̃": "ザン", "dœ̃": "ダン", "və": "ヴ", "wɛ̃": "ワン",
        "fɔ̃": "フォン","dɛ̃": "ダン",
        "bjɛ": "ビェ", "bja": "ビャー", "bjɔ": "ビョン",
        "mjɛ": "ミェ", "mja": "ミャー", "mjɔ": "ミョン",
        "ʁjɛ": "リェ", "ʁja": "リャー", "ʁjɔ": "リョン",
        "njɛ": "ニェ", "njɔ": "ニョン","nja": "ニァ","nje": "ニェー",
        "ʃjɛ": "シィェ", "ʃja": "シィャー", "ʃjɔ": "シィョン",
        "jɛ̃": "ヤン", "jɑ̃": "ヤンー", "jɔ̃": "ヨン",
        "mwa":"ムァ","twa":"トゥァ","bwa":"ブァ",
        "kwa":"クァ","swa":"スァ","ʃwa":"シュァ",
        "jwa":"ヂュァ","nwa": "ヌァ",

    # 2 phonèmes
        "ka": "カ", "ki": "キ", "ky": "ク", "kɥ": "ク", "kə": "ク", "kœ": "クー", "kø": "クー", "kɛ": "ケ", "ke": "ケェー",
        "ko": "コー",
        "kɔ": "コ", "sa": "サ", "ʃi": "シ", "sy": "ス", "sə": "ス", "sɥ": "ス", "sœ": "スー", "sø": "スー", "su": "スーウ",
        "sɛ": "セ",
        "se": "セェー", "sɔ": "ソ", "so": "ソー", "ta": "タ", "te": "テェー", "tɛ": "テ", "to": "トー", "tɔ": "ト", "na": "ナ",
        "ni": "ニ",
        "nj": "ニ", "nə": "ヌ", "nø": "ヌー", "nœ": "ヌー", "ny": "ヌ", "nɥ": "ヌ", "nu": "ヌー", "nɛ": "ネ", "ne": "ネェー",
        "no": "ノー",
        "nɔ": "ノ", "fy": "フ", "fu": "フー", "ma": "マ", "mj": "ミ", "mi": "ミ", "my": "ム", "mɥ": "ム", "mœ": "ムー", "mø": "ムー",
        "mə": "ム", "mu": "ムー", "me": "メェ", "mɛ": "メ", "mɔ": "モ", "mo": "モー", "ja": "ヤ", "jy": "ユ", "jɔ": "ヨ", "jo": "ヨ",
        "ju": "ヨー", "ʁa": "ラ", "la": "ラ", "li": "リ", "ʁj": "リ", "ʁi": "リ", "ʁə": "ル", "ʁø": "ルー", "ʁœ": "ルー",
        "lø": "ルー",
        "lœ": "ルー", "lə": "ル", "ʁy": "ル", "rɥ": "ル", "ʁu": "ルー", "lɛ": "レ", "ʁɛ": "レ", "le": "レェー", "ʁe": "レェー",
        "ʁo": "ロー",
        "lo": "ロー", "ʁɔ": "ロ", "lɔ": "ロ", "wa": "ワ", "ʃa": "シャ", "ʃy": "シュ", "ʃo": "ショー", "ʃɔ": "ショ", "ɡa": "ガ",
        "ɡi": "ギ",
        "gy": "グ", "gɥ": "グ", "ɡə": "グ", "ɡø": "グー", "ɡœ": "グー", "ɡɛ": "ゲ", "ɡe": "ゲェー", "ɡɔ": "ゴ", "ɡo": "ゴ",
        "ɡu": "ゴー",
        "za": "ザ", "zi": "ヅィ", "ʒi": "ヂ", "ʒœ": "ヂェ", "zy": "ズ", "zɥ": "ズ", "zə": "ズ", "zø": "ズー", "zœ": "ズー",
        "zu": "ズー",
        "zɛ": "ゼ", "ze": "ゼェー", "zo": "ゾー","dj": "ディ", "da": "ダ", "dɛ": "デ", "de": "デェー", "dɔ": "ド", "do": "ドー", "ba": "バ",
        "bi": "ビ",
        "by": "ブ", "bɥ": "ブ", "bə": "ブ", "bœ": "ブー", "bø": "ブー", "bu": "ブー", "bɛ": "ベ", "be": "ベー", "bɔ": "ボ",
        "bo": "ボー",
        "pa": "パ", "pi": "ピ", "py": "プ", "pɥ": "プ", "pə": "プ", "pu": "プー", "pœ": "プー", "pø": "プー", "pɛ": "ペ",
        "pe": "ペェー",
        "pɔ": "ポ", "po": "ポー", "va": "ヴァ", "fa": "ファ", "vi": "ヴィ", "si": "スィ", "ti": "ティ", "di": "ディ", "fi": "フィ",
        "vy": "ヴ", "vu": "ヴー", "ty": "トゥ", "tɥ": "トゥ", "tə": "トゥ", "tu": "トゥー", "tø": "トゥー", "tœ": "トゥー", "dy": "ドゥ",
        "dɥ": "ドゥ", "də": "ドゥ", "du": "ドゥー", "dø": "ドゥー", "dœ": "ドゥー", "vɛ": "ヴェ", "ve": "ヴェー", "ʒe": "ジェー", "ʃɛ": "シェ",
        "fɛ": "フェ", "vɔ": "ヴォ", "vo": "ヴォー", "fɔ": "フォ", "fo": "フォー", "ɑ̃": "アンー", "ɛ̃": "アン", "ɔ̃": "オン", "ʃe": "シェー",
        "ʃə": "シュ", "ʒu": "ヂュ", "ʒɔ": "ヂョ", "ʒo": "ヂョー", "zɔ": "ゾ", "œ̃": "アン", "wɛ": "ウェ", "we": "ウェー", "wo": "ウォー",
        "wɔ": "ウォ", "ʒa": "ヂャ", "jɛ": "イェ", "ʒɛ": "ジェ", "jə": "イュ", "ʒə": "ヂュ", "zj": "ヅィ", "ku": "クー","wu": "ウュー",
        "wy": "ウュ","wi": "ウィ","je": "イェー",
        # 1 phonème
        "a": "ア", "i": "イ", "j": "イー", "y": "ウ", "ɥ": "ウ", "ə": "ウ", "u": "ウー", "ø": "ウ", "œ": "ウ", "ɛ": "エ",
        "e": "エー",
        "ɔ": "オ", "o": "オー", "k": "ク", "s": "ス", "n": "ン", "f": "フ", "l": "ル", "ɡ": "グ", "m": "ム", "b": "ブ", "t": "トゥ",
        "ʁ": "ル", "p": "プ", "d": "ドゥ", "v": "ヴ", "ʃ": "シュ", "ʒ": "ヂュ", "z": "ズ"
    }

    for i in dico:
        a = a.replace(i, dico[i])

    return(a.replace('|',', ').replace('‖','. '))

for i in texte:
    print(i+'\n')
    a, b = '', ''
    for sentence in sentences(i, lang="fr"):
        for word in sentence:
            for p in word.phonemes:
                a+=p
    if a.endswith('‖'):
        a=a[:-1]

    for sentence in sentences(i.replace(' ',', '), lang="fr"):
        for word in sentence:
            for p in word.phonemes:
                b+=p
    if b.endswith('‖'):
        b=b[:-1]

    print('Phrases continues :\n')
    for i in a.replace('nɔʁɛst','nə').split('‖'):
        # bug dans gruut, "ne" est interprété comme la direction nord-est.
        print(kata(i) + '.\n')

    print('Mots séparés :\n')
    for i in b.replace('‖|','‖').replace('||','|').replace('nɔʁɛst','nə').split('‖'):
        for j in i.split('|'):
            print(kata(j)+'. ')
        print('')
    print('\n')
